Repository: GSM-MSG/StudyMate-iOS
Catalog: StudyMate/Resources/Localizable.xcstrings
Source language: en
Languages: ar, bn, de, es, fa, fr, he, hi, it, ja, ko, pl, pt_br, ru, tr, uk_ua, zh_hans

source: Good morning!
ar: صباح الخير!
bn: সুপ্রভাত!
de: Guten Morgen!
es: ¡Buenos días!
fa: صبح بخیر!
fr: Bonjour !
he: בוקר טוב!
hi: नमस्कार, सुप्रभात!
it: Buongiorno!
ja: おはようございます！
ko: 좋은 아침이에요!
pl: Dzień dobry!
pt_br: Bom dia!
ru: Доброе утро!
tr: Günaydın!
uk_ua: Доброго ранку!
zh_hans: 早上好！

source: Image
ar: صورة
bn: ছবি
de: Bild
es: Imagen
fa: تصویر
he: תמונה
hi: छवि
it: Immagine
ja: 画像
ko: 이미지
pl: Obraz
pt_br: Imagem
ru: Изображение
tr: Görsel
uk_ua: Зображення
zh_hans: 图片

# keep_up_good_work
source: Keep up the good work!
ar: استمر في العمل الجيد!
bn: ভালো কাজ চালিয়ে যান!
de: Weiter so!
es: ¡Sigue con el buen trabajo!
fa: به کار خوبت ادامه بده!
fr: Continuez comme ça !
he: המשך בעבודה הטובה!
hi: अच्छा काम जारी रखें!
it: Continua così!
ja: その調子で頑張ってください！
ko: 늦은 시간까지 수고하세요!
pl: Tak trzymaj!
pt_br: Continue com o bom trabalho!
ru: Так держать!
tr: İyi çalışmaya devam et!
uk_ua: Так тримати!
zh_hans: 继续保持出色的表现！

# learn_something_new_today
source: Ready to learn something new today?
ar: هل أنت مستعد لتعلم شيء جديد اليوم؟
bn: আজ কিছু নতুন শিখতে প্রস্তুত?
de: Bereit, heute etwas Neues zu lernen?
es: ¿Listo para aprender algo nuevo hoy?
fa: آماده‌ای امروز چیز جدیدی یاد بگیری؟
fr: Prêt à apprendre quelque chose de nouveau aujourd'hui ?
he: מוכן ללמוד משהו חדש היום?
hi: आज कुछ नया सीखने के लिए तैयार हैं?
it: Pronto a imparare qualcosa di nuovo oggi?
ja: 今日も新しいことを学ぶ準備はできていますか？
ko: 오늘도 새로운 것을 배워볼까요?
pl: Gotowy, aby nauczyć się czegoś nowego dzisiaj?
pt_br: Pronto para aprender algo novo hoje?
ru: Готовы узнать что-то новое сегодня?
tr: Bugün yeni bir şey öğrenmeye hazır mısın?
uk_ua: Готові вивчити щось нове сьогодні?
zh_hans: 准备好今天学习新知识了吗？

# less_than_minute
source: Less than 1 min
ar: أقل من دقيقة
bn: ১ মিনিটেরও কম
de: Weniger als 1 min
es: Menos de 1 min
fa: کمتر از ۱ دقیقه
fr: Moins d'1 min
he: פחות מדקה
hi: 1 मिनट से कम
it: Meno di 1 min
ja: 1分未満
ko: 1분 미만
pl: Mniej niż 1 min
pt_br: Menos de 1 min
ru: Меньше 1 минуты
tr: 1 dakikadan az
uk_ua: Менше 1 хв
zh_hans: 少于 1 分钟

source: Loading...
ar: جارٍ التحميل...
bn: লোড হচ্ছে...
de: Wird geladen...
es: Cargando...
fa: در حال بارگذاری...
fr: Chargement...
he: טוען...
hi: लोड हो रहा है...
it: Caricamento...
ja: 読み込み中...
ko: 로딩 중...
pl: Ładowanie...
pt_br: Carregando...
ru: Загрузка...
tr: Yükleniyor...
uk_ua: Завантаження...
zh_hans: 加载中...

source: Monthly Study Time
ar: وقت الدراسة الشهري
bn: মাসিক অধ্যয়নের সময়
de: Monatliche Lernzeit
es: Tiempo de estudio mensual
fa: زمان مطالعه ماهانه
fr: Temps d'étude mensuel
he: זמן לימוד חודשי
hi: मासिक अध्ययन समय
it: Tempo di studio mensile
ja: 月間学習時間
ko: 이번 달 학습 시간
pl: Miesięczny czas nauki
pt_br: Tempo de estudo mensal
ru: Ежемесячное время обучения
tr: Aylık çalışma süresi
uk_ua: Щомісячний час навчання
zh_hans: 每月学习时间

source: No data available
ar: لا توجد بيانات متاحة
bn: কোন তথ্য পাওয়া যায়নি
de: Keine Daten verfügbar
es: No hay datos disponibles
fa: اطلاعاتی موجود نیست
fr: Aucune donnée disponible
he: אין נתונים זמינים
hi: कोई डेटा उपलब्ध नहीं है
it: Nessun dato disponibile
ja: データがありません
ko: 데이터가 없습니다
pl: Brak dostępnych danych
pt_br: Nenhum dado disponível
ru: Данные отсутствуют
tr: Veri bulunmuyor
uk_ua: Немає доступних даних
zh_hans: 暂无数据

source: No study records yet
ar: لا توجد سجلات دراسة حتى الآن
bn: এখনও কোন অধ্যয়ন রেকর্ড নেই
de: Noch keine Lerneinträge
es: Aún no hay registros de estudio
fa: هنوز سابقه مطالعه‌ای وجود ندارد
fr: Pas encore d'enregistrements d'étude
he: אין עדיין רשומות לימוד
hi: अभी तक कोई अध्ययन रिकॉर्ड नहीं है
it: Ancora nessuna registrazione di studio
ja: 学習記録がまだありません
ko: 아직 학습 기록이 없습니다
pl: Brak zapisów nauki
pt_br: Ainda não há registros de estudo
ru: Записей об обучении пока нет
tr: Henüz çalışma kaydı yok
uk_ua: Ще немає записів навчання
zh_hans: 暂无学习记录

source: Okay
ar: حسنًا
bn: ঠিক আছে
es: Aceptar
fa: تأیید
fr: D'accord
he: אישור
hi: ठीक है
it: Ok
ja: OK
ko: 확인
pl: OK
pt_br: Ok
ru: Ок
tr: Tamam
uk_ua: Гаразд
zh_hans: 确定

# onboarding_add_content_add_file
source: Add File
ar: إضافة ملف
bn: ফাইল যোগ করুন
de: Datei hinzufügen
es: Añadir archivo
fa: افزودن فایل
fr: Ajouter un fichier
he: הוסף קובץ
hi: फ़ाइल जोड़ें
it: Aggiungi file
ja: ファイルを追加
ko: 파일 추가
pl: Dodaj plik
pt_br: Adicionar arquivo
ru: Добавить файл
tr: Dosya ekle
uk_ua: Додати файл
zh_hans: 添加文件

# onboarding_add_content_demo_title
source: Create Study Record
ar: إنشاء سجل دراسة
bn: অধ্যয়ন রেকর্ড তৈরি করুন
de: Lernnotiz erstellen
es: Crear registro de estudio
fa: ایجاد سابقه مطالعه
fr: Créer un enregistrement d'étude
he: צור רשומת לימוד
hi: अध्ययन रिकॉर्ड बनाएँ
it: Crea registro di studio
ja: 学習記録を作成
ko: 학습 기록 만들기
pl: Utwórz zapis nauki
pt_br: Criar registro de estudo
ru: Создать учебную запись
tr: Çalışma kaydı oluştur
uk_ua: Створити запис навчання
zh_hans: 创建学习记录

# onboarding_add_content_field_attachments
source: Attachments
ar: المرفقات
bn: সংযুক্তিসমূহ
de: Anhänge
es: Archivos adjuntos
fa: پیوست‌ها
fr: Pièces jointes
he: קבצים מצורפים
hi: अटैचमेंट
it: Allegati
ja: 添付ファイル
ko: 첨부파일
pl: Załączniki
pt_br: Anexos
ru: Вложения
tr: Ekler
uk_ua: Вкладення
zh_hans: 附件

# onboarding_add_content_field_content
source: Content
ar: المحتوى
bn: বিষয়বস্তু
de: Inhalt
es: Contenido
fa: محتوا
fr: Contenu
he: תוכן
hi: सामग्री
it: Contenuto
ja: 内容
ko: 내용
pl: Treść
pt_br: Conteúdo
ru: Контент
tr: İçerik
uk_ua: Вміст
zh_hans: 内容

# onboarding_add_content_field_duration
source: Study Time
ar: وقت الدراسة
bn: অধ্যয়নের সময়
de: Lernzeit
es: Tiempo de estudio
fa: زمان مطالعه
fr: Temps d'étude
he: זמן לימוד
hi: अध्ययन समय
it: Tempo di studio
ja: 学習時間
ko: 학습 시간
pl: Czas nauki
pt_br: Tempo de estudo
ru: Время обучения
tr: Çalışma süresi
uk_ua: Час навчання
zh_hans: 学习时间

# onboarding_add_content_field_title
source: Title
ar: العنوان
bn: শিরোনাম
de: Titel
es: Título
fa: عنوان
fr: Titre
he: כותרת
hi: शीर्षक
it: Titolo
ja: タイトル
ko: 제목
pl: Tytuł
pt_br: Título
ru: Заголовок
tr: Başlık
uk_ua: Заголовок
zh_hans: 标题

# onboarding_add_content_placeholder_duration
source: Select time
ar: اختر الوقت
bn: সময় নির্বাচন করুন
de: Zeit auswählen
es: Seleccionar tiempo
fa: زمان را انتخاب کنید
fr: Sélectionner le temps
he: בחר זמן
hi: समय चुनें
it: Seleziona il tempo
ja: 時間を選択
ko: 시간 선택
pl: Wybierz czas
pt_br: Selecione o tempo
ru: Выберите время
tr: Süre seç
uk_ua: Виберіть час
zh_hans: 选择时间

# onboarding_add_content_placeholder_title
source: Enter the title of your learning content
ar: أدخل عنوان محتوى التعلم الخاص بك
bn: আপনার শিক্ষণ বিষয়বস্তুর শিরোনাম লিখুন
de: Gib den Titel deines Lerninhalts ein
es: Introduce el título de tu contenido de aprendizaje
fa: عنوان محتوای آموزشی خود را وارد کنید
fr: Saisissez le titre de votre contenu d'apprentissage
he: הזן את הכותרת של תוכן הלמידה שלך
hi: अपनी लर्निंग सामग्री का शीर्षक दर्ज करें
it: Inserisci il titolo del tuo contenuto di apprendimento
ja: 学習内容のタイトルを入力してください
ko: 학습 내용의 제목을 입력하세요
pl: Wprowadź tytuł treści edukacyjnej
pt_br: Digite o título do seu conteúdo de aprendizagem
ru: Введите заголовок вашего учебного контента
tr: Öğrenme içeriğinizin başlığını girin
uk_ua: Введіть заголовок вашого навчального матеріалу
zh_hans: 输入您的学习内容标题

# onboarding_add_content_tip1
source: Write specific titles and content
ar: اكتب عناوين ومحتوى محددة
bn: নির্দিষ্ট শিরোনাম এবং বিষয়বস্তু লিখুন
de: Schreibe spezifische Titel und Inhalte
es: Escribe títulos y contenido específicos
fa: عنوان‌ها و محتوای مشخص بنویسید
fr: Rédigez des titres et contenus spécifiques
he: כתוב כותרות ותוכן ספציפיים
hi: विशिष्ट शीर्षक और सामग्री लिखें
it: Scrivi titoli e contenuti specifici
ja: 具体的なタイトルと内容を書きましょう
ko: 구체적인 제목과 내용을 작성하세요
pl: Pisz konkretne tytuły i treści
pt_br: Escreva títulos e conteúdos específicos
ru: Пишите конкретные заголовки и контент
tr: Belirli başlıklar ve içerikler yazın
uk_ua: Пишіть конкретні заголовки та вміст
zh_hans: 撰写具体的标题和内容

# onboarding_add_content_tip2
source: You can attach various materials like photos, PDFs, and scans
ar: يمكنك إرفاق مواد متنوعة مثل الصور وملفات PDF والمسح الضوئي
bn: আপনি ছবি, পিডিএফ এবং স্ক্যান করা নথি সহ বিভিন্ন উপকরণ সংযুক্ত করতে পারেন
de: Du kannst verschiedene Materialien wie Fotos, PDFs und Scans anhängen
es: Puedes adjuntar diversos materiales como fotos, PDFs y escaneos
fa: می‌توانید مطالب مختلفی مانند عکس، PDF و اسکن را پیوست کنید
fr: Vous pouvez joindre divers documents comme des photos, PDF et numérisations
he: תוכל לצרף חומרים שונים כמו תמונות, קבצי PDF וסריקות
hi: आप फोटो, पीडीएफ और स्कैन जैसी विभिन्न सामग्रियां अटैच कर सकते हैं
it: Puoi allegare vari materiali come foto, PDF e scansioni
ja: 写真、PDF、スキャンなど様々な資料を添付できます
ko: 사진, PDF, 스캔 등 다양한 자료를 첨부할 수 있습니다
pl: Możesz załączać różne materiały, takie jak zdjęcia, pliki PDF i skany
pt_br: Você pode anexar diversos materiais como fotos, PDFs e digitalizações
ru: Вы можете прикреплять различные материалы, такие как фотографии, PDF и сканы
tr: Fotoğraflar, PDF'ler ve taramalar gibi çeşitli materyaller ekleyebilirsiniz
uk_ua: Ви можете прикріпити різні матеріали, як-от фотографії, PDF-файли та скани
zh_hans: 您可以附加各种材料，如照片、PDF和扫描件

# onboarding_add_content_tip3
source: Record study time to manage your progress
ar: سجل وقت الدراسة لإدارة تقدمك
bn: আপনার অগ্রগতি পরিচালনা করতে অধ্যয়নের সময় রেকর্ড করুন
de: Erfasse deine Lernzeit, um deinen Fortschritt zu verwalten
es: Registra el tiempo de estudio para gestionar tu progreso
fa: زمان مطالعه را ثبت کنید تا پیشرفت خود را مدیریت کنید
fr: Enregistrez votre temps d'étude pour gérer votre progression
he: תעד את זמן הלימוד כדי לנהל את ההתקדמות שלך
hi: अपनी प्रगति का प्रबंधन करने के लिए अध्ययन समय रिकॉर्ड करें
it: Registra il tempo di studio per gestire i tuoi progressi
ja: 学習時間を記録して進捗を管理しましょう
ko: 학습 시간을 기록하여 진도를 관리하세요
pl: Rejestruj czas nauki, aby zarządzać postępami
pt_br: Registre o tempo de estudo para gerenciar seu progresso
ru: Записывайте время обучения, чтобы управлять своим прогрессом
tr: İlerlemenizi yönetmek için çalışma süresini kaydedin
uk_ua: Записуйте час навчання, щоб керувати своїм прогресом
zh_hans: 记录学习时间以管理您的进度

# onboarding_add_content_tips_title
source: Tips
ar: نصائح
bn: টিপস
de: Tipps
es: Consejos
fa: نکات
fr: Conseils
he: טיפים
hi: टिप्स
it: Suggerimenti
ja: ヒント
ko: 팁
pl: Wskazówki
pt_br: Dicas
ru: Советы
tr: İpuçları
uk_ua: Поради
zh_hans: 提示

# onboarding_ai_analysis_results
source: AI Analysis Results
ar: نتائج تحليل الذكاء الاصطناعي
bn: এআই বিশ্লেষণ ফলাফল
de: KI-Analyseergebnisse
es: Resultados del análisis de IA
fa: نتایج تحلیل هوش مصنوعی
fr: Résultats de l'analyse IA
he: תוצאות ניתוח בינה מלאכותית
hi: एआई विश्लेषण परिणाम
it: Risultati dell'analisi AI
ja: AI分析結果
ko: AI 분석 결과
pl: Wyniki analizy AI
pt_br: Resultados da análise de IA
ru: Результаты анализа ИИ
tr: Yapay zeka analiz sonuçları
uk_ua: Результати аналізу ШІ
zh_hans: AI分析结果

# onboarding_ai_benefit1
source: Automatically analyzes study content and provides feedback
ar: يحلل محتوى الدراسة تلقائيًا ويقدم ملاحظات
bn: স্বয়ংক্রিয়ভাবে অধ্যয়ন সামগ্রী বিশ্লেষণ করে এবং প্রতিক্রিয়া প্রদান করে
de: Analysiert Lerninhalt automatisch und gibt Feedback
es: Analiza automáticamente el contenido de estudio y proporciona retroalimentación
fa: به طور خودکار محتوای مطالعه را تحلیل کرده و بازخورد ارائه می‌دهد
fr: Analyse automatiquement le contenu d'étude et fournit des commentaires
he: מנתחת אוטומטית את תוכן הלימוד ומספקת משוב
hi: अध्ययन सामग्री का स्वचालित विश्लेषण करता है और प्रतिक्रिया प्रदान करता है
it: Analizza automaticamente i contenuti di studio e fornisce feedback
ja: 学習内容を自動的に分析してフィードバックを提供
ko: 학습 내용을 자동으로 분석하고 피드백 제공
pl: Automatycznie analizuje treści nauki i dostarcza informacje zwrotne
pt_br: Analisa automaticamente o conteúdo de estudo e fornece feedback
ru: Автоматически анализирует учебный материал и предоставляет обратную связь
tr: Çalışma içeriğini otomatik olarak analiz eder ve geri bildirim sağlar
uk_ua: Автоматично аналізує навчальний контент і надає відгуки
zh_hans: 自动分析学习内容并提供反馈

# onboarding_ai_benefit2
source: Personalized improvement suggestions and supplementary learning
ar: اقتراحات تحسين مخصصة وتعلم تكميلي
bn: ব্যক্তিগতকৃত উন্নতির পরামর্শ এবং পরিপূরক শিক্ষা
de: Personalisierte Verbesserungsvorschläge und ergänzende Lernmaterialien
es: Sugerencias de mejora personalizadas y aprendizaje complementario
fa: پیشنهادات بهبود شخصی‌سازی شده و یادگیری تکمیلی
fr: Suggestions d'amélioration personnalisées et apprentissage complémentaire
he: הצעות שיפור מותאמות אישית ולמידה משלימה
hi: व्यक्तिगत सुधार सुझाव और पूरक शिक्षण
it: Suggerimenti personalizzati per migliorare e apprendimento supplementare
ja: 個別の改善提案と補足学習
ko: 개인 맞춤형 개선 제안 및 보충 학습
pl: Spersonalizowane sugestie poprawy i dodatkowe materiały do nauki
pt_br: Sugestões de melhoria personalizadas e aprendizado complementar
ru: Персонализированные рекомендации по улучшению и дополнительное обучение
tr: Kişiselleştirilmiş gelişim önerileri ve tamamlayıcı öğrenme
uk_ua: Персоналізовані пропозиції щодо вдосконалення та додаткове навчання
zh_hans: 个性化的改进建议和补充学习

# onboarding_ai_benefit3
source: Continuous learning path guidelines
ar: إرشادات مستمرة لمسار التعلم
bn: ধারাবাহিক শিক্ষা পথের নির্দেশিকা
de: Kontinuierliche Lernwegempfehlungen
es: Guías continuas de ruta de aprendizaje
fa: راهنمای مسیر یادگیری مداوم
fr: Lignes directrices continues pour le parcours d'apprentissage
he: הנחיות מסלול למידה מתמשכות
hi: निरंतर सीखने के मार्ग के दिशानिर्देश
it: Linee guida continue per il percorso di apprendimento
ja: 継続的な学習パスのガイドライン
ko: 지속적인 학습 경로 가이드라인
pl: Wskazówki dotyczące ciągłej ścieżki nauki
pt_br: Diretrizes contínuas para o caminho de aprendizado
ru: Рекомендации для непрерывного обучения
tr: Sürekli öğrenme yolu kılavuzları
uk_ua: Рекомендації щодо постійного шляху навчання
zh_hans: 持续的学习路径指导

# onboarding_ai_benefits_title
source: Benefits of AI Analysis
ar: فوائد تحليل الذكاء الاصطناعي
bn: এআই বিশ্লেষণের সুবিধাসমূহ
de: Vorteile der KI-Analyse
es: Beneficios del análisis de IA
fa: مزایای تحلیل هوش مصنوعی
fr: Avantages de l'analyse IA
he: יתרונות של ניתוח בינה מלאכותית
hi: AI विश्लेषण के लाभ
it: Vantaggi dell'analisi AI
ja: AI分析のメリット
ko: AI 분석의 장점
pl: Korzyści z analizy AI
pt_br: Benefícios da análise de IA
ru: Преимущества AI-анализа
tr: Yapay zeka analizinin faydaları
uk_ua: Переваги аналізу ШІ
zh_hans: AI 分析的优势

# onboarding_ai_demo_record_title
source: Study Record
ar: سجل الدراسة
bn: অধ্যয়ন রেকর্ড
de: Lernaufzeichnung
es: Registro de estudio
fa: سابقه مطالعه
fr: Enregistrement d'étude
he: רשומת לימוד
hi: अध्ययन रिकॉर्ड
it: Registrazione di studio
ja: 学習記録
ko: 학습 기록
pl: Zapis nauki
pt_br: Registro de estudo
ru: Запись занятия
tr: Çalışma kaydı
uk_ua: Запис навчання
zh_hans: 学习记录

# onboarding_ai_demo_title
source: AI Tutor Analysis
ar: تحليل المعلم الذكي
bn: এআই টিউটর বিশ্লেষণ
de: KI-Tutor-Analyse
es: Análisis del tutor de IA
fa: تحلیل مربی هوش مصنوعی
fr: Analyse du tuteur IA
he: ניתוח מורה בינה מלאכותית
hi: AI ट्यूटर विश्लेषण
it: Analisi del tutor AI
ja: AIチューター分析
ko: AI 튜터 분석
pl: Analiza AI Tutora
pt_br: Análise do tutor de IA
ru: Анализ AI-репетитора
tr: Yapay zeka eğitmen analizi
uk_ua: Аналіз ШІ-репетитора
zh_hans: AI 导师分析

# onboarding_ai_feedback_1_content
source: Great job organizing SwiftUI State and Binding concepts! Your theoretical foundation is solid.
ar: عمل رائع في تنظيم مفاهيم SwiftUI State وBinding! أساسك النظري متين.
bn: SwiftUI স্টেট এবং বাইন্ডিং ধারণাগুলি সংগঠিত করার জন্য চমৎকার কাজ! আপনার তাত্ত্বিক ভিত্তি দৃঢ়।
de: Tolle Arbeit bei der Organisation der SwiftUI State- und Binding-Konzepte! Deine theoretische Grundlage ist solide.
es: ¡Excelente trabajo organizando los conceptos de State y Binding de SwiftUI! Tu base teórica es sólida.
fa: کار عالی در سازماندهی مفاهیم State و Binding در SwiftUI! پایه نظری شما قوی است.
fr: Excellent travail d'organisation des concepts State et Binding de SwiftUI ! Votre base théorique est solide.
he: עבודה מצוינת בארגון מושגי State ו-Binding ב-SwiftUI! הבסיס התיאורטי שלך איתן.
hi: SwiftUI स्टेट और बाइंडिंग अवधारणाओं को व्यवस्थित करने के लिए शानदार काम! आपकी सैद्धांतिक नींव मजबूत है।
it: Ottimo lavoro nell'organizzare i concetti di State e Binding di SwiftUI! La tua base teorica è solida.
ja: SwiftUIのStateとBindingの概念をうまく整理できています！理論的な基礎がしっかりしています。
ko: SwiftUI의 State와 Binding 개념을 잘 정리했네요! 이론적 기반이 탄탄합니다.
pl: Świetna robota z organizacją koncepcji SwiftUI State i Binding! Twoje podstawy teoretyczne są solidne.
pt_br: Ótimo trabalho organizando os conceitos de State e Binding do SwiftUI! Sua base teórica é sólida.
ru: Отличная работа с организацией концепций SwiftUI State и Binding! У вас хорошая теоретическая база.
tr: SwiftUI State ve Binding kavramlarını düzenlemede harika iş çıkardın! Teorik temelin sağlam.
uk_ua: Чудова робота з організації концепцій SwiftUI State та Binding! Ваша теоретична база міцна.
zh_hans: 很好地整理了 SwiftUI 的 State 和 Binding 概念！你的理论基础很扎实。

# onboarding_ai_feedback_1_title
source: Content Analysis
ar: تحليل المحتوى
bn: বিষয়বস্তু বিশ্লেষণ
de: Inhaltsanalyse
es: Análisis de contenido
fa: تحلیل محتوا
fr: Analyse du contenu
he: ניתוח תוכן
hi: सामग्री विश्लेषण
it: Analisi dei contenuti
ja: 内容分析
ko: 콘텐츠 분석
pl: Analiza treści
pt_br: Análise de conteúdo
ru: Анализ содержания
tr: İçerik analizi
uk_ua: Аналіз контенту
zh_hans: 内容分析

# onboarding_ai_feedback_2_content
source: Learning about the differences between @StateObject and @ObservedObject would deepen your understanding.
ar: التعرف على الاختلافات بين @StateObject و@ObservedObject سيعمق فهمك.
bn: @StateObject এবং @ObservedObject এর মধ্যে পার্থক্য সম্পর্কে জানলে আপনার বোঝাপড়া আরও গভীর হবে।
de: Das Lernen über die Unterschiede zwischen @StateObject und @ObservedObject würde dein Verständnis vertiefen.
es: Aprender sobre las diferencias entre @StateObject y @ObservedObject profundizaría tu comprensión.
fa: یادگیری درباره تفاوت‌های بین @StateObject و @ObservedObject درک شما را عمیق‌تر خواهد کرد.
fr: Apprendre les différences entre @StateObject et @ObservedObject approfondirait votre compréhension.
he: למידה על ההבדלים בין @StateObject ל-@ObservedObject תעמיק את ההבנה שלך.
hi: @StateObject और @ObservedObject के बीच अंतर के बारे में जानने से आपकी समझ गहरी होगी।
it: Approfondire le differenze tra @StateObject e @ObservedObject migliorerebbe la tua comprensione.
ja: @StateObjectと@ObservedObjectの違いについて学ぶと理解が深まるでしょう。
ko: @StateObject와 @ObservedObject의 차이점에 대해 학습하면 이해도가 더욱 깊어질 것입니다.
pl: Nauka o różnicach między @StateObject a @ObservedObject pogłębiłaby Twoje zrozumienie.
pt_br: Aprender sobre as diferenças entre @StateObject e @ObservedObject aprofundaria seu entendimento.
ru: Изучение различий между @StateObject и @ObservedObject углубит ваше понимание.
tr: @StateObject ve @ObservedObject arasındaki farkları öğrenmek anlayışını derinleştirecektir.
uk_ua: Вивчення відмінностей між @StateObject та @ObservedObject поглибить ваше розуміння.
zh_hans: 学习 @StateObject 和 @ObservedObject 的区别将加深你的理解。

# onboarding_ai_feedback_2_title
source: Improvement Suggestions
ar: اقتراحات التحسين
bn: উন্নতির পরামর্শ
de: Verbesserungsvorschläge
es: Sugerencias de mejora
fa: پیشنهادات بهبود
fr: Suggestions d'amélioration
he: הצעות לשיפור
hi: सुधार के सुझाव
it: Suggerimenti per migliorare
ja: 改善提案
ko: 개선 제안
pl: Sugestie poprawy
pt_br: Sugestões de melhoria
ru: Рекомендации по улучшению
tr: Gelişim önerileri
uk_ua: Пропозиції щодо вдосконалення
zh_hans: 改进建议

# onboarding_ai_feedback_3_content
source: I recommend practicing data binding implementation in real projects.
ar: أوصي بممارسة تنفيذ ربط البيانات في مشاريع حقيقية.
bn: আমি বাস্তব প্রকল্পে ডাটা বাইন্ডিং বাস্তবায়ন অনুশীলন করার পরামর্শ দিচ্ছি।
de: Ich empfehle, die Implementierung von Datenbindung in realen Projekten zu üben.
es: Recomiendo practicar la implementación de enlace de datos en proyectos reales.
fa: پیشنهاد می‌کنم پیاده‌سازی اتصال داده را در پروژه‌های واقعی تمرین کنید.
fr: Je recommande de pratiquer l'implémentation de la liaison de données dans des projets réels.
he: אני ממליץ להתאמן ביישום קישור נתונים בפרויקטים אמיתיים.
hi: मैं वास्तविक प्रोजेक्ट्स में डेटा बाइंडिंग कार्यान्वयन का अभ्यास करने की सलाह देता हूँ।
it: Ti consiglio di esercitarti nell'implementazione del data binding in progetti reali.
ja: 実際のプロジェクトでデータバインディングの実装を練習することをお勧めします。
ko: 실제 프로젝트에서 데이터 바인딩 구현을 연습해 보시기를 권장합니다.
pl: Zalecam ćwiczenie implementacji wiązania danych w rzeczywistych projektach.
pt_br: Recomendo praticar a implementação de vinculação de dados em projetos reais.
ru: Рекомендую попрактиковаться в реализации привязки данных в реальных проектах.
tr: Gerçek projelerde veri bağlama uygulaması yapmanı tavsiye ederim.
uk_ua: Рекомендую практикувати реалізацію прив'язки даних у реальних проєктах.
zh_hans: 建议在实际项目中练习数据绑定的实现。

# onboarding_ai_feedback_3_title
source: Next Steps
ar: الخطوات التالية
bn: পরবর্তী পদক্ষেপ
de: Nächste Schritte
es: Próximos pasos
fa: گام‌های بعدی
fr: Prochaines étapes
he: צעדים הבאים
hi: अगले कदम
it: Prossimi passi
ja: 次のステップ
ko: 다음 단계
pl: Kolejne kroki
pt_br: Próximos passos
ru: Следующие шаги
tr: Sonraki adımlar
uk_ua: Наступні кроки
zh_hans: 下一步

# onboarding_ai_start_analysis
source: Start AI Analysis
ar: بدء تحليل الذكاء الاصطناعي
bn: এআই বিশ্লেষণ শুরু করুন
de: KI-Analyse starten
es: Iniciar análisis de IA
fa: شروع تحلیل هوش مصنوعی
fr: Démarrer l'analyse IA
he: התחל ניתוח בינה מלאכותית
hi: AI विश्लेषण शुरू करें
it: Avvia analisi AI
ja: AI分析を開始
ko: AI 분석 시작하기
pl: Rozpocznij analizę AI
pt_br: Iniciar análise de IA
ru: Начать AI-анализ
tr: Yapay zeka analizini başlat
uk_ua: Почати аналіз ШІ
zh_hans: 开始 AI 分析

# onboarding_dashboard_demo_title
source: Dashboard Tour
ar: جولة في لوحة المعلومات
bn: ড্যাশবোর্ড ভ্রমণ
es: Recorrido por el panel
fa: گشت و گذار در داشبورد
fr: Visite guidée du tableau de bord
he: סיור בלוח המחוונים
hi: डैशबोर्ड टूर
it: Tour della dashboard
ja: ダッシュボードツアー
ko: 대시보드 둘러보기
pl: Przegląd pulpitu
pt_br: Tour pelo painel
ru: Обзор панели управления
tr: Kontrol paneli turu
uk_ua: Огляд панелі керування
zh_hans: 仪表板导览

# onboarding_dashboard_recent_records
source: Recent Study Records
ar: سجلات الدراسة الأخيرة
bn: সাম্প্রতিক অধ্যয়ন রেকর্ডসমূহ
de: Neueste Lernaufzeichnungen
es: Registros de estudio recientes
fa: سوابق مطالعه اخیر
fr: Enregistrements d'étude récents
he: רשומות לימוד אחרונות
hi: हाल के अध्ययन रिकॉर्ड
it: Registrazioni di studio recenti
ja: 最近の学習記録
ko: 최근 학습 기록
pl: Ostatnie zapisy nauki
pt_br: Registros de estudo recentes
ru: Недавние записи о занятиях
tr: Son çalışma kayıtları
uk_ua: Останні записи навчання
zh_hans: 最近的学习记录

# onboarding_dashboard_stat_streak
source: Study Streak
ar: تتابع الدراسة
bn: অধ্যয়ন স্ট্রিক
de: Lernserie
es: Racha de estudio
fa: روند مطالعه
fr: Série d'études
he: רצף לימוד
hi: अध्ययन स्ट्रीक
it: Serie di studio
ja: 学習連続日数
ko: 연속 학습
pl: Seria nauki
pt_br: Sequência de estudos
ru: Серия занятий
tr: Çalışma serisi
uk_ua: Серія навчань
zh_hans: 学习连续天数

# onboarding_dashboard_stat_time
source: Total Time
ar: الوقت الإجمالي
bn: মোট সময়
de: Gesamtzeit
es: Tiempo total
fa: زمان کل
fr: Temps total
he: זמן כולל
hi: कुल समय
it: Tempo totale
ja: 合計時間
ko: 총 학습 시간
pl: Całkowity czas
pt_br: Tempo total
ru: Общее время
tr: Toplam süre
uk_ua: Загальний час
zh_hans: 总时长

# onboarding_dashboard_stat_total
source: Total Records
ar: إجمالي السجلات
bn: মোট রেকর্ড
de: Gesamtaufzeichnungen
es: Registros totales
fa: کل سوابق
fr: Total des enregistrements
he: סך הרשומות
hi: कुल रिकॉर्ड
it: Registrazioni totali
ja: 記録総数
ko: 총 기록 수
pl: Łączna liczba zapisów
pt_br: Total de registros
ru: Всего записей
tr: Toplam kayıtlar
uk_ua: Загальна кількість записів
zh_hans: 总记录数

# onboarding_dashboard_stat_weekly
source: This Week
ar: هذا الأسبوع
bn: এই সপ্তাহ
de: Diese Woche
es: Esta semana
fa: این هفته
fr: Cette semaine
he: השבוע
hi: इस सप्ताह
it: Questa settimana
ja: 今週
ko: 이번 주
pl: Ten tydzień
pt_br: Esta semana
ru: Эта неделя
tr: Bu hafta
uk_ua: Цей тиждень
zh_hans: 本周
